# How to Read in Dataset of Different Storage Formats

Index
- MongoDB
- Matlab
- R
- Excel
- CSV
- XML
- JSON
- HTML
- SQL

In [4]:
import pandas as pd 
import numpy as np

## MongoDB

In [48]:
pip install pymongo

Collecting pymongo
  Downloading pymongo-4.13.2-cp313-cp313-macosx_11_0_arm64.whl.metadata (22 kB)
Collecting dnspython<3.0.0,>=1.16.0 (from pymongo)
  Using cached dnspython-2.7.0-py3-none-any.whl.metadata (5.8 kB)
Downloading pymongo-4.13.2-cp313-cp313-macosx_11_0_arm64.whl (965 kB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 965.9/965.9 kB 15.6 MB/s eta 0:00:00
Using cached dnspython-2.7.0-py3-none-any.whl (313 kB)
Installing collected packages: dnspython, pymongo
Successfully installed dnspython-2.7.0 pymongo-4.13.2

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [52]:
from pymongo.mongo_client import MongoClient
from pymongo.server_api import ServerApi

### Send me your current IP address so I can add it to my access list and you can connect

Find it by going to https://ifconfig.me

In [91]:
uri = "mongodb+srv://agracedickerson:phMBilxxOovgZOHK@agd-trainingcluster.hx4oloh.mongodb.net/?retryWrites=true&w=majority&appName=AGD-trainingCluster"

In [93]:
# Create a new client and connect to the server
client = MongoClient(uri, server_api=ServerApi('1'))

# Send a ping to confirm a successful connection
try:
    client.admin.command('ping')
    print("Pinged your deployment. You successfully connected to MongoDB!")
except Exception as e:
    print(e)

Pinged your deployment. You successfully connected to MongoDB!

In [79]:
# Step 1 - Print all database names
print("üì¶ Databases on this cluster:")
print(client.list_database_names())

üì¶ Databases on this cluster:
['sample_mflix', 'admin', 'local']

In [80]:
# STEP 2 ‚Äî Pick a known database from the above and list collections
db = client["sample_mflix"]  # Or AGD-trainingCluster, etc.

print(f"üìÅ Collections in `{db.name}`:")
print(db.list_collection_names())

üìÅ Collections in `sample_mflix`:
['theaters', 'users', 'sessions', 'movies', 'comments', 'embedded_movies']

In [81]:
# STEP 3 ‚Äî Pick a known collection and sample documents
collection = db["comments"]  # Or "movies", "users", etc.

docs = list(collection.find().limit(3))
print(f"üìÑ Sample documents from `{collection.name}`:")
for d in docs:
    print(d)

üìÑ Sample documents from `comments`:
{'_id': ObjectId('5a9427648b0beebeb69579e7'), 'name': 'Mercedes Tyler', 'email': 'mercedes_tyler@fakegmail.com', 'movie_id': ObjectId('573a1390f29313caabcd4323'), 'text': 'Eius veritatis vero facilis quaerat fuga temporibus. Praesentium expedita sequi repellat id. Corporis minima enim ex. Provident fugit nisi dignissimos nulla nam ipsum aliquam.', 'date': datetime.datetime(2002, 8, 18, 4, 56, 7)}
{'_id': ObjectId('5a9427648b0beebeb69579f5'), 'name': 'John Bishop', 'email': 'john_bishop@fakegmail.com', 'movie_id': ObjectId('573a1390f29313caabcd446f'), 'text': 'Id error ab at molestias dolorum incidunt. Non deserunt praesentium dolorem nihil. Optio tempora vel ut quas.\nMinus dicta numquam quasi. Rem totam cumque at eum. Ullam hic ut ea magni.', 'date': datetime.datetime(1975, 1, 21, 0, 31, 22)}
{'_id': ObjectId('5a9427648b0beebeb6957a21'), 'name': "Jaqen H'ghar", 'email': 'tom_wlaschiha@gameofthron.es', 'movie_id': ObjectId('573a1390f29313caabcd516c'), 'text': 'Minima odit officiis minima nam. Aspernatur id reprehenderit eius inventore amet laudantium. Eos unde enim recusandae fugit sint.', 'date': datetime.datetime(1981, 11, 8, 4, 32, 25)}

In [82]:
# Get the first comment
first = collection.find_one()
print(first)

{'_id': ObjectId('5a9427648b0beebeb69579e7'), 'name': 'Mercedes Tyler', 'email': 'mercedes_tyler@fakegmail.com', 'movie_id': ObjectId('573a1390f29313caabcd4323'), 'text': 'Eius veritatis vero facilis quaerat fuga temporibus. Praesentium expedita sequi repellat id. Corporis minima enim ex. Provident fugit nisi dignissimos nulla nam ipsum aliquam.', 'date': datetime.datetime(2002, 8, 18, 4, 56, 7)}

In [83]:
# what class is the comment?
# then we can create a movie_id of the correct data class so we can search the database for
# the movie with that movie_id
first = collection.find_one()
print(type(first["movie_id"]))

<class 'bson.objectid.ObjectId'>

In [62]:
from bson import ObjectId

movie_id = ObjectId("573a1390f29313caabcd4323")
results = collection.find({"movie_id": movie_id})

for collection in results:
    print(collection["name"], "‚Üí", collection["text"])

Mercedes Tyler ‚Üí Eius veritatis vero facilis quaerat fuga temporibus. Praesentium expedita sequi repellat id. Corporis minima enim ex. Provident fugit nisi dignissimos nulla nam ipsum aliquam.

In [65]:
from collections import defaultdict

In [77]:
def summarize_mongo_db_structure(db, sample_size=100):
    """
    Prints field names and data types from each collection in a MongoDB database.
    
    Args:
        db: pymongo database object
        sample_size: number of documents to sample per collection
    """
    print(f"üîç Database: {db.name}")
    collections = db.list_collection_names()
    
    for col_name in collections:
        print(f"\nüìÅ Collection: `{col_name}`")
        collection = db[col_name]
        sample_docs = list(collection.find().limit(sample_size))
        
        if not sample_docs:
            print("‚ö†Ô∏è No documents found.")
            continue
        
        field_types = defaultdict(set)
        for doc in sample_docs:
            for field, value in doc.items():
                field_types[field].add(type(value).__name__)
        
        df = pd.DataFrame([
            {"Field": field, "Data Types": ", ".join(sorted(types))}
            for field, types in field_types.items()
        ]).sort_values("Field")
        
        display(df)

In [78]:
# summarize the schema (field names + data types) for each collection in sample_mflix
summarize_mongo_db_structure(db)

üîç Database: sample_mflix

üìÅ Collection: `theaters`

       Field Data Types
0        _id   ObjectId
2   location       dict
1  theaterId        int

üìÅ Collection: `users`

      Field Data Types
0       _id   ObjectId
2     email        str
1      name        str
3  password        str

üìÅ Collection: `sessions`

     Field Data Types
0      _id   ObjectId
2      jwt        str
1  user_id        str

üìÅ Collection: `movies`

                 Field Data Types
0                  _id   ObjectId
12              awards       dict
4                 cast       list
16           countries       list
10           directors       list
7             fullplot        str
2               genres       list
15                imdb       dict
8            languages       list
13         lastupdated        str
19  num_mflix_comments        int
1                 plot        str
5               poster        str
11               rated        str
9             released   datetime
3              runtime        int
6                title        str
18            tomatoes       dict
17                type        str
20             writers       list
14                year        int

üìÅ Collection: `comments`

      Field Data Types
0       _id   ObjectId
5      date   datetime
2     email        str
3  movie_id   ObjectId
1      name        str
4      text        str

üìÅ Collection: `embedded_movies`

                            Field Data Types
0                             _id   ObjectId
14                         awards       dict
5                            cast       list
18                      countries       list
12                      directors       list
9                        fullplot        str
2                          genres       list
17                           imdb       dict
10                      languages       list
15                    lastupdated        str
23                     metacritic        int
6              num_mflix_comments        int
1                            plot        str
21                 plot_embedding     Binary
22  plot_embedding_voyage_3_large     Binary
7                          poster        str
4                           rated        str
11                       released   datetime
3                         runtime        int
8                           title        str
20                       tomatoes       dict
19                           type        str
13                        writers       list
16                           year        int

## Matlab

**Easiest Way: Save table as .csv in MATLAB**

In matlab run: **writetable(myTable, 'my_table.csv')**<br>
Then can do: **df = pd.read_csv("my_table.csv")** (Example in the code cell below)

*Do NOT do this with a matlab table that contains an array.* Only import matlab tables
that do not have sub-arrays and can easily be converted to a csv.

If you REALLY want to deal with that, you can explore trying to do it with either the package:
-  h5py (for MATLAB v7.3+ tables)
-  scipy.io.loadmat (for older-style .mat files, v7.2 or earlier)

In [87]:
matlab2csv2df = pd.read_csv("data/NiehLabTable.csv")
matlab2csv2df.loc[:, ['FrameNumber', 'timeData', 'Trial', 'trialClass']]

      FrameNumber     timeData  Trial  trialClass
0            1034    69.226392      1           1
1            1035    69.293342      1           1
2            1036    69.360292      1           1
3            1037    69.427242      1           1
4            1038    69.494192      1           1
...           ...          ...    ...         ...
2319        48608  3254.309912     75           1
2320        48609  3254.376862     75           1
2321        48610  3254.443812     75           1
2322        48611  3254.510762     75           1
2323        48612  3254.577712     75           1

[2324 rows x 4 columns]

## R

In [101]:
pip install pyreadr

Collecting pyreadr
  Downloading pyreadr-0.5.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (1.4 kB)
Requirement already satisfied: pandas>=1.2.0 in /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/lib/python3.13/site-packages (from pyreadr) (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/lib/python3.13/site-packages (from pandas>=1.2.0->pyreadr) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/lib/python3.13/site-packages (from pandas>=1.2.0->pyreadr) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/lib/python3.13/site-packages (from pandas>=1.2.0->pyreadr) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/lib/python3.13/site-packages (from pandas>=1.2.0->pyreadr) (2024.2)
Requirement already satisfied: six>=1.5 in /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas>=1.2.0->pyreadr) (1.17.0)
Downloading pyreadr-0.5.3-cp313-cp313-macosx_11_0_arm64.whl (313 kB)
Installing collected packages: pyreadr
Successfully installed pyreadr-0.5.3

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [105]:
rds2python = pyreadr.read_r('data/iris.rds')
rds2python

OrderedDict([(None,
                   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
              0             5.1          3.5           1.4          0.2     setosa
              1             4.9          3.0           1.4          0.2     setosa
              2             4.7          3.2           1.3          0.2     setosa
              3             4.6          3.1           1.5          0.2     setosa
              4             5.0          3.6           1.4          0.2     setosa
              ..            ...          ...           ...          ...        ...
              145           6.7          3.0           5.2          2.3  virginica
              146           6.3          2.5           5.0          1.9  virginica
              147           6.5          3.0           5.2          2.0  virginica
              148           6.2          3.4           5.4          2.3  virginica
              149           5.9          3.0           5.1          1.8  virginica

              [150 rows x 5 columns])])

In [ ]:
import pyreadr

In [107]:
rds2df = rds2python[None]
rds2df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

## Seurat Objects

Common when working with sequencing data.

To download the original example rds version from the satija lab, go to:
**https://www.dropbox.com/s/kwd3kcxkmpzqg6w/pbmc3k_final.rds?dl=0**
<br>Then in R you can do:<br>
`install.packages("SeuratObject")`<br>
`install.packages("Seurat")`

`library(SeuratObject)`<br>
`library(Seurat)`

`pbmc <- readRDS("pbmc3k_final.rds")`

Then, in R you must convert the rds seurat object to an h5ad file. Download [sceasy](https://github.com/cellgeni/sceasy) and then do something like this:
`devtools::install_github("cellgeni/sceasy")install.packages("reticulate")`
`install.packages("reticulate")`

`library(sceasy)`
`library(anndata)`

`sceasy::convertFormat(pbmc, from="seurat", to="anndata", outFile='pbmc.h5ad')`

In [95]:
# pip install anndata
import anndata as ad

adata = ad.read_h5ad('data/pbmc.h5ad')

In [97]:
adata

AnnData object with n_obs √ó n_vars = 2638 √ó 13714
    obs: 'percent.mito', 'res.0.6', 'ClusterNames_0.6', 'res.0.8', 'nCount_RNA', 'nFeature_RNA'
    var: 'name'
    obsm: 'X_pca', 'X_tsne'

In [100]:
adata.obs.head()

,percent.mito,res.0.6,ClusterNames_0.6,res.0.8,nCount_RNA,nFeature_RNA
AAACATACAACCAC,0.030178,0,CD4 T cells,1,2419.0,779
AAACATTGAGCTAC,0.037936,2,B cells,3,4903.0,1352
AAACATTGATCAGC,0.008897,0,CD4 T cells,1,3147.0,1129
AAACCGTGCTTCCG,0.017431,1,CD14+ Monocytes,2,2639.0,960
AAACCGTGTATGCG,0.012245,5,NK cells,6,980.0,521

Then in R you can convert the h4ad back to an rds file that you can read into your R notebook as normal using this package: [sceasy](https://github.com/cellgeni/sceasy) <br>

<br>Your block of R code would look something like:<br>
```
sceasy::convertFormat("data/dataFromPython.h5ad", from="anndata", to="seurat", outFile="data/python2R.rds")
```

## Excel

In [5]:
excel2df= pd.read_excel('data/student.xlsx') # excel file 
excel2df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

## CSV

In [7]:
csv2df= pd.read_csv('data/student.csv') # csv  file 
csv2df.head(2)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male

## XML

In [9]:
pip install lxml

Collecting lxml
  Downloading lxml-6.0.0-cp313-cp313-macosx_10_13_universal2.whl.metadata (6.6 kB)
Downloading lxml-6.0.0-cp313-cp313-macosx_10_13_universal2.whl (8.4 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 8.4/8.4 MB 24.0 MB/s eta 0:00:00a 0:00:01
Installing collected packages: lxml
Successfully installed lxml-6.0.0

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import lxml

In [18]:
# Reads XML file
xml2df = pd.read_xml("data/student.xml")
xml2df.tail()

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

## JSON

In [20]:
json2df = pd.read_json("data/student.json")
json2df.iloc[5:10,:]

   id         name  class  mark  gender
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male
7   8       Asruid   Five    85    male
8   9      Tes Qry    Six    78    male
9  10     Big John   Four    55  female

##### Note: If the JSON is nested (e.g., deeply nested objects), you might need to normalize it

In [21]:
from pandas import json_normalize

In [22]:
nested_json = {
  "people": [
    {"name": "Alice", "details": {"age": 30, "city": "NY"}},
    {"name": "Bob", "details": {"age": 25, "city": "LA"}}
  ]
}

In [24]:
nested_json

{'people': [{'name': 'Alice', 'details': {'age': 30, 'city': 'NY'}},
  {'name': 'Bob', 'details': {'age': 25, 'city': 'LA'}}]}

In [23]:
nested_json2df = json_normalize(nested_json["people"])
nested_json2df

    name  details.age details.city
0  Alice           30           NY
1    Bob           25           LA

## HTML

In [10]:
import lxml # don't need to do this if already did it for xml in this notebook. But would in future notebooks.

#### Example 1 - from saved file:

In [11]:
# Reads all tables from the HTML file into a list of DataFrames
tables = pd.read_html("data/student.html")

# Select the first table (or loop through them if needed)
df = tables[0]
print(df.head())

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

#### Example 2 - from website url

In [25]:
url = "https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population"

In [27]:
# From a local HTML file
url2df = pd.read_html(url)[0]
url2df.head()

,Location,Population,% of world,Date,Source (official or from the United Nations),Notes
0,World,8232000000,100%,13 Jun 2025,UN projection[1][3],NaN
1,India,1413324000,17.3%,1 Mar 2025,Official projection[4],[b]
2,China,1408280000,17.2%,31 Dec 2024,Official estimate[5],[c]
3,United States,340110988,4.2%,1 Jul 2024,Official estimate[6],[d]
4,Indonesia,282477584,3.4%,30 Jun 2024,National annual projection[7],NaN

In [34]:
all_dfs_at_url = pd.read_html(url)
print(f"Number of tables found: {len(all_dfs_at_url)}")

Number of tables found: 3

In [39]:
tableNum3 = pd.read_html(url)[2]
tableNum3.head()

,vteWorld,vteWorld.1
0,AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua ...,AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua ...

### Below, write code to check what the second table has in it:

## SQL Table

In [13]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading sqlalchemy-2.0.41-cp313-cp313-macosx_11_0_arm64.whl.metadata (9.6 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/lib/python3.13/site-packages (from sqlalchemy) (4.12.2)
Downloading sqlalchemy-2.0.41-cp313-cp313-macosx_11_0_arm64.whl (2.1 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 2.1/2.1 MB 21.9 MB/s eta 0:00:00
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-2.0.41

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: /opt/homebrew/Cellar/jupyterlab/4.3.4_1/libexec/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

### Example using a sql SQLite database since I can create one in this notebook.
But the commands are the same to pull from a SQL database.

In [14]:
from sqlalchemy import create_engine,text

In [42]:
# Create an in-memory SQLite database
engine = create_engine("sqlite:///:memory:")

In [43]:
# Sample table
with engine.begin() as conn:
    conn.execute(text("""
        CREATE TABLE student (
            id INTEGER PRIMARY KEY,
            name TEXT,
            age INTEGER
        )
    """))
    conn.execute(text("""
        INSERT INTO student (name, age) VALUES
        ('Alice', 20), ('Bob', 22), ('Charlie', 23)
    """))

In [45]:
# Read from the table
with engine.connect() as conn:
    sql = text("SELECT * FROM student")
    sql2df = pd.read_sql(sql, conn)

In [46]:
sql2df

   id     name  age
0   1    Alice   20
1   2      Bob   22
2   3  Charlie   23